In [95]:
import pandas as pd
import numpy as np

# üßê Checking the "Main" Dataset
---

In [96]:
df_applications = pd.read_csv('../data/external/application_train.csv')

In [101]:
df_applications.head()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
0,456162,0,Cash loans,F,N,N,0,112500.0,700830.0,22738.5,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,1.0
1,134978,0,Cash loans,F,N,N,0,90000.0,375322.5,14422.5,...,0,0,0,0,0.0,0.0,0.0,1.0,0.0,3.0
2,318952,0,Cash loans,M,Y,N,0,180000.0,544491.0,16047.0,...,0,0,0,0,0.0,0.0,0.0,1.0,1.0,3.0
3,361264,0,Cash loans,F,N,Y,0,270000.0,814041.0,28971.0,...,0,0,0,0,0.0,0.0,0.0,0.0,1.0,4.0
4,260639,0,Cash loans,F,N,Y,0,144000.0,675000.0,21906.0,...,0,0,0,0,0.0,0.0,0.0,10.0,0.0,0.0

In [102]:
df_applications.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 246008 entries, 0 to 246007
Columns: 122 entries, SK_ID_CURR to AMT_REQ_CREDIT_BUREAU_YEAR
dtypes: float64(65), int64(41), object(16)
memory usage: 229.0+ MB

There are **246k+** records in the dataset and **122** columns. Far too many columns to check with ```head()``` function. A better way to get more familiar with the dataset is to display ```n``` columns at a time and note highlights.

In [112]:
# Creating an Iterator to display 7 columns at a time
iterator = iter(list(range(0,122+1)))

display(df.iloc[:5,[next(iterator) for i in range(7)]].style.hide(axis='index'))

**Further Checking**
- Are there any duplicated IDs?
- Which contract types are present in the dataset?

In [125]:
print(f'There are {df_applications["SK_ID_CURR"].nunique()} unique IDs in the Dataset '
      f'and {len(df_applications["SK_ID_CURR"])} records.\n'
      f'The types of contract are: {df_applications["NAME_CONTRACT_TYPE"].unique()}')

There are 246008 unique IDs in the Datasetand 246008 records.
The types of contract are: ['Cash loans' 'Revolving loans']

**Highlights**

Revolving Loans are not very common in Brazil üáßüá∑. So, I researched a little bit more about feature ```NAME_CONTRACT_TYPE```. Found good information in these link: 
- https://www.youtube.com/watch?v=NXUZNJRMxCQ
-https://www.investopedia.com/terms/r/revolving-loan-facility.asp.

In [113]:
df.iloc[:5,[next(iterator) for i in range(7)]].style.hide(axis='index')

**Highlights**

- ```NAME_EDUCATION_TYPE``` may be converted to an Ordinal Numerical feature.

In [131]:
df.iloc[:5,[next(iterator) for i in range(7)]].style.hide(axis='index')

In [134]:
df.iloc[:5,[next(iterator) for i in range(7)]].style.hide(axis='index')

**Further Checking**
- Finally, we found the first NaNs. In this case, they are not necessarily missing values. They are expected if the applicant does not own a car. So, checking if there are any NaNs when ```FLAG_OWN_CAR``` is "Y" is interesting.

In [171]:
print('Applications flagged as owning a car and not informing car age: '
      f'{df_applications["OWN_CAR_AGE"][df_applications["FLAG_OWN_CAR"]=="Y"].isna().sum()}.')

Applications flagged as owning a car and not informing car age: 4.

**Highlights**

- ```OWN_CAR_AGE``` and ```FLAG_OWN_CAR``` may be transformed into one column. As there are only 4 NaNs, they also might be considered as "0".

In [172]:
df.iloc[:5,[next(iterator) for i in range(7)]].style.hide(axis='index')

In [176]:
df_applications['WEEKDAY_APPR_PROCESS_START'].value_counts()

TUESDAY      43046
WEDNESDAY    41418
MONDAY       40709
THURSDAY     40616
FRIDAY       40202
SATURDAY     27083
SUNDAY       12934
Name: WEEKDAY_APPR_PROCESS_START, dtype: int64

In [177]:
df.iloc[:5,[next(iterator) for i in range(7)]].style.hide(axis='index')

In [180]:
df_applications['ORGANIZATION_TYPE'].value_counts(dropna=False)

Business Entity Type 3    54495
XNA                       44399
Self-employed             30722
Other                     13350
Medicine                   8982
Business Entity Type 2     8433
Government                 8330
School                     7078
Trade: type 7              6258
Kindergarten               5448
Construction               5389
Business Entity Type 1     4859
Transport: type 4          4277
Trade: type 3              2767
Industry: type 9           2695
Industry: type 3           2627
Security                   2594
Housing                    2368
Industry: type 11          2138
Military                   2114
Bank                       1980
Agriculture                1960
Police                     1866
Transport: type 2          1745
Postal                     1719
Security Ministries        1565
Trade: type 2              1506
Restaurant                 1478
Services                   1264
University                 1057
Industry: type 7           1037
Transport: type 3           927
Industry: type 1            834
Hotel                       778
Electricity                 736
Industry: type 4            718
Trade: type 6               504
Industry: type 5            492
Insurance                   469
Telecom                     467
Emergency                   443
Industry: type 2            367
Advertising                 332
Realtor                     328
Culture                     306
Industry: type 12           282
Trade: type 1               272
Mobile                      254
Legal Services              235
Cleaning                    208
Transport: type 1           153
Industry: type 10            87
Industry: type 6             86
Religion                     67
Trade: type 4                53
Industry: type 13            49
Trade: type 5                41
Industry: type 8             20
Name: ORGANIZATION_TYPE, dtype: int64